{
  "0": {
    "name": "Unknown",
    "desc": "A device for catching wild Pokémon. It's thrown like a ball, comfortably encapsulating its target."
  },
  "1": {
    "name": "Poké Ball",
    "desc": "A high-performance ball with a higher catch rate than a standard Poké Ball."
  },
  "2": {
    "name": "Great Ball",
    "desc": "An ultra-performance ball with a higher catch rate than a Great Ball."
  },
  "3": {
    "name": "Ultra Ball",
    "desc": "A spray-type medicine that restores the HP of one Pokémon by 20 points."
  },
  "4": {
    "name": "Master Ball",
    "desc": "The best Poké Ball with the ultimate level of performance. With it, you will catch any wild Pokémon without fail."
  },
  "5": {
    "name": "Premier Ball",
    "desc": ""
  },
  "101": {
    "name": "Potion",
    "desc": "A spray-type medicine that restores the HP of one Pokémon by 50 points."
  },
  "102": {
    "name": "Super Potion",
    "desc": "A spray-type medicine that restores the HP of one Pokémon by 200 points."
  },
  "103": {
    "name": "Hyper Potion",
    "desc": "A spray-type medicine that completely restores all HP of a single Pokémon."
  },
  "104": {
    "name": "Max Potion",
    "desc": "A medicine that can revive fainted Pokémon. It also restores half of a fainted Pokémon's maximum HP."
  },
  "201": {
    "name": "Revive",
    "desc": "A medicine that can revive fainted Pokémon. It also restores half of a fainted Pokémon's maximum HP."
  },
  "202": {
    "name": "Max Revive",
    "desc": "A medicine that can revive fainted Pokémon. It also fully restores a fainted Pokémon's maximum HP."
  },
  "301": {
    "name": "Lucky Egg",
    "desc": "A Lucky Egg that's filled with happiness! Earns double XP for 30 minutes."
  },
  "401": {
    "name": "Incense",
    "desc": "Incense with a mysterious fragrance that lures wild Pokémon to your location for 30 minutes. Its  appearance changes when  attracting specific Pokémon."
  },
  "402": {
    "name": "Incense Spicy",
    "desc": ""
  },
  "403": {
    "name": "Incense Cool",
    "desc": ""
  },
  "404": {
    "name": "Incense Floral",
    "desc": ""
  },
  "405": {
    "name": "Mystery Box",
    "desc": "A mysterious old box. Opening it causes a certain Pokémon to appear for a limited time."
  },
  "406": {
    "name": "Daily Adventure Incense",
    "desc": "Special Incense with a mysterious fragrance that attracts wild Pokémon to your location as you move for 15 minutes. You can receive one each day at no cost."
  },
  "407": {
    "name": "Incense Sparkly",
    "desc": ""
  },
  "501": {
    "name": "Lure Module",
    "desc": "A module that attracts Pokémon to a PokéStop for 30 minutes. The effect benefits other people nearby."
  },
  "502": {
    "name": "Glacial Lure Module",
    "desc": "A frosty Lure Module that attracts Pokémon for 30 minutes, especially ones that love the cold. It can also cause some Pokémon to evolve."
  },
  "503": {
    "name": "Mossy Lure Module",
    "desc": "A natural Lure Module that attracts Pokémon for 30 minutes, especially ones that love mossy scents. It can also cause some Pokémon to evolve."
  },
  "504": {
    "name": "Magnetic Lure Module",
    "desc": "An electronic Lure Module that attracts Pokémon for 30 minutes, especially ones that possess a magnetic field. It can also cause some Pokémon to evolve."
  },
  "505": {
    "name": "Rainy Lure Module",
    "desc": "A wet Lure Module that attracts Pokémon for 30 minutes, especially ones that love the rain. It can also cause some Pokémon to evolve."
  },
  "506": {
    "name": "Sparkly Lure Module",
    "desc": ""
  },
  "602": {
    "name": "X Attack",
    "desc": ""
  },
  "603": {
    "name": "X Defense",
    "desc": ""
  },
  "604": {
    "name": "X Miracle",
    "desc": ""
  },
  "701": {
    "name": "Razz Berry",
    "desc": "Feed this to a Pokémon to make it easier to catch."
  },
  "702": {
    "name": "Bluk Berry",
    "desc": ""
  },
  "703": {
    "name": "Nanab Berry",
    "desc": "Feed this to a Pokémon to calm it down, making it less erratic."
  },
  "704": {
    "name": "Wepar Berry",
    "desc": ""
  },
  "705": {
    "name": "Pinap Berry",
    "desc": "Feed this to a Pokémon to receive more Candy when you catch it."
  },
  "706": {
    "name": "Golden Razz Berry",
    "desc": "Feed this to a Pokémon to make it much easier to catch."
  },
  "707": {
    "name": "Golden Pinap Berry",
    "desc": ""
  },
  "708": {
    "name": "Silver Pinap Berry",
    "desc": "Feed this to a Pokémon to receive more Candy when you catch it and make it easier to catch."
  },
  "709": {
    "name": "Poffin",
    "desc": "A special treat for your buddy!"
  },  
  "801": {
    "name": "Camera",
    "desc": "A device to capture photos of Pokémon. Photos can be shared with others."
  },
  "901": {
    "name": "Egg Incubator ∞",
    "desc": "A device that incubates an Egg as you walk until it's ready to hatch. Unlimited use!"
  },
  "902": {
    "name": "Egg Incubator",
    "desc": "A device that incubates an Egg as you walk until it is ready to hatch. Breaks after 3 uses."
  },
  "903": {
    "name": "Super Incubator",
    "desc": "A more powerful Egg Incubator that helps Eggs hatch quickly. Breaks after 3 uses."
  },
  "1001": {
    "name": "Pokémon Storage Upgrade",
    "desc": ""
  },
  "1002": {
    "name": "Item Storage Upgrade",
    "desc": ""
  },
  "1003": {
    "name": "Postcard Storage Upgrade",
    "desc": ""
  },
  "1101": {
    "name": "Sun Stone",
    "desc": "A peculiar stone that can make certain species of Pokémon evolve. It burns as red as the evening sun."
  },
  "1102": {
    "name": "Kings Rock",
    "desc": "A rock that can make certain species of Pokémon evolve. It looks like a crown."
  },
  "1103": {
    "name": "Metal Coat",
    "desc": "A coating that can make certain species of Pokémon evolve. It is a special metallic film."
  },
  "1104": {
    "name": "Dragon Scale",
    "desc": "A scale that can make certain species of Pokémon evolve. It is very tough and inflexible."
  },
  "1105": {
    "name": "Upgrade",
    "desc": "A transparent device that can make certain species of Pokémon evolve. It was produced by Silph Co."
  },
  "1106": {
    "name": "Sinnoh Stone",
    "desc": "A special stone originally found in the Sinnoh region that can make certain species of Pokémon evolve. It is very tough and has a beautiful sheen."
  },
  "1107": {
    "name": "Unova Stone",
    "desc": "A rare stone that originates from the Unova region that can make certain species of Pokémon evolve. It is known for its intertwined black-and-white appearance."
  },
  "1150": {
    "name": "?????? Coin",
    "desc": "A coin with a mysterious air. It seems to have originated in the Paldea region."
  },
  "1201": {
    "name": "Fast TM",
    "desc": "This Technical Machine teaches the Pokémon a new Fast Attack."
  },
  "1202": {
    "name": "Charged TM",
    "desc": "This Technical Machine teaches the Pokémon a new Charged Attack."
  },
  "1203": {
    "name": "Elite Fast TM",
    "desc": "This Technical Machine lets you choose a Fast Attack to teach to a Pokémon."
  },
  "1204": {
    "name": "Elite Charge TM",
    "desc": "This Technical Machine lets you choose a Charged Attack to teach to a Pokémon."
  },  
  "1301": {
    "name": "Rare Candy",
    "desc": "A mysterious candy. When used on a Pokémon, it turns into the Pokémon's Candy."
  },
  "1302": {
    "name": "Rare Candy XL",
    "desc": "A mysterious candy. When used on a Pokémon, it turns into the Pokémon's Candy XL."
  },
  "1401": {
    "name": "Raid Pass",
    "desc": "Pass to join a Raid Battle. You can get a free pass at Gyms once per day if you don't already have one."
  },
  "1402": {
    "name": "Premium Battle Pass",
    "desc": "A Premium Battle Pass can be used to join a Raid Battle or earn premium rewards in the GO Battle League."
  },
  "1403": {
    "name": "EX Raid Pass",
    "desc": "EX Raid Pass to join a special Raid Battle. You can use this pass only at the specified limited-time event."
  },
  "1404": {
    "name": "Star Piece",
    "desc": "A small shard of a beautiful gem. Earns 50% more Stardust for 30 minutes."
  },
  "1405": {
    "name": "Gift",
    "desc": "A box that you can send to a friend. Contains a variety of useful items."
  },
  "1406": {
    "name": "Team Medallion",
    "desc": "A unique coin that enables a Trainer to change teams. It can only be purchased once per 365 days."
  },
  "1408": {
    "name": "Remote Raid Pass",
    "desc": "A Remote Raid Pass can be used to join a Raid Battle remotely."
  },
  "1501": {
    "name": "Mysterious Component",
    "desc": "This appears to be what Team GO Rocket uses to hack PokéStops. Does it have another use?"
  },
  "1502": {
    "name": "Rocket Radar",
    "desc": "You can use this to track down Team GO Rocket Hideouts!"
  },
  "1503": {
    "name": "Super Rocket Radar",
    "desc": "You can use this to track down Team GO Rocket Headquarters where their Boss might be!"
  },
  "1504": {
    "name": "Shadow Shard",
    "desc": "A mysterious shard that emanates shadowy energy. Collect four to combine them into a larger gem with the Shard Refiner!"
  },
  "1505": {
    "name": "Purified Gem",
    "desc": "A clear gem created by purifying and combining Shadow Shards. Use it to subdue enraged Shadow Raid Bosses."
  },
  "1600": {
    "name": "Ticket",
    "desc": "A ticket to access special event bonuses."
  },
  "1601": {
    "name": "Ticket",
    "desc": "A ticket to access special event bonuses."
  },
  "1602": {
    "name": "Ticket",
    "desc": "A ticket to access special event bonuses."
  },
  "1603": {
    "name": "Ticket",
    "desc": "A ticket to access special event bonuses."
  },
  "1604": {
    "name": "Ticket",
    "desc": "A ticket to access special event bonuses."
  },
  "1605": {
    "name": "Ticket",
    "desc": "A ticket to access special event bonuses."
  },
  "1606": {
    "name": "Ticket",
    "desc": "A ticket to access special event bonuses."
  },
  "1607": {
    "name": "Ticket",
    "desc": "A ticket to access special event bonuses."
  },
  "1608": {
    "name": "Ticket",
    "desc": "A ticket to access special event bonuses."
  }
}
